backend/app/controllers/api/v1/trips_controller.rb

  def create
    @trip = Trip.create(trip_params)
---
INSERT INTO "trips" ("created_at", "updated_at", "city", "state", "country") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2018-03-26 21:24:04.991807"], ["updated_at", "2018-03-26 21:24:04.991807"], ["city", "my citys a"], ["state", "sucker your citys a"], ["country", "my citys a"]]